// answers.js에서 export하고 있는 모듈의 이름은 answersDetails입니다.
// index.js에서 이 모듈을 불러와서 사용하세요.
const answersDetails = [
    /*
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    이곳에는 정답이 저장되어 있습니다. 학습을 위해서 스크롤을 내리지 않으시는 것을 권장합니다.
    */
    {
        answer: 'O',
        explain: 'Node.js는 JavaScript를 브라우저 외부에서 실행할 수 있게 하는 런타임 환경입니다.',
    },
    {
        answer: 'O',
        explain: '현재 사용 중인 Stackblitz 환경의 Node.js 버전은 v18.18입니다.',
    },
    {
        answer: 'X',
        explain: 'Node.js는 Ryan Dahl에 의해 개발되었으며, Microsoft가 아닌 개인 개발자에 의한 작업이었습니다.',
    },
    {
        answer: 'X',
        explain: 'JavaScript는 원래 브라우저에서 사용되도록 개발되었지만, Node.js 등의 기술 덕분에 서버 사이드 등 다양한 환경에서도 사용됩니다.',
    },
    {
        answer: 'O',
        explain: 'node 명령어를 터미널에서 실행하면 Node.js의 REPL(Read-Eval-Print Loop) 환경이 시작됩니다.',
    },
    {
        answer: 'X',
        explain: 'Node.js 환경에서는 기본적으로 require 함수를 사용하여 모듈을 불러옵니다. 최신 ECMAScript 모듈에서는 import 키워드를 사용할 수 있습니다.',
    },
    {
        answer: 'O',
        explain: '다른 파일에서 모듈을 사용하려면 해당 모듈이 export되어 있어야 합니다.',
    },
    {
        answer: 'X',
        explain: 'require 함수는 Node.js의 모듈 시스템에 속하며, 브라우저에서는 사용할 수 없습니다.',
    },
    {
        answer: 'X',
        explain: 'console 객체는 브라우저와 Node.js 모두에서 사용 가능합니다.',
    },
    {
        answer: 'X',
        explain: 'Node.js는 프론트엔드 개발자에게도 유용하며, 빌드 도구, 개발 서버 등 다양한 환경에서 활용됩니다.',
    },
];

module.exports = answersDetails;
