// 1. 출석 체크하기
const 출석부 = ['철수', '영희', '진수', '미애', '수지', '은우', '고은', '도현', '지민', '지수']
const 교실 = 출석부.filter(()=> Math.random() < 0.7) 



// 2. 사과 갯수 세보기
let 사과박스 = new Array(Math.floor(Math.random()*100)).fill('🍎')
const 정답 = 사과박스.length



// 5. 1부터 n까지 더하기



// 4. 모음 개수 세기
const 모음 = ['a','i','u','e','o']



// 5. 구구단 찍기



// 6. 배열 & 객체 다루기
const 회원목록 = [
    {회원번호:0, 성별:'남', 나이:16},
    {회원번호:1, 성별:'여', 나이:18},
    {회원번호:2, 성별:'남', 나이:21},
    {회원번호:3, 성별:'여', 나이:25},
    {회원번호:4, 성별:'여', 나이:29},
    {회원번호:5, 성별:'여', 나이:30},
    {회원번호:6, 성별:'남', 나이:31},
    {회원번호:7, 성별:'여', 나이:37},
    {회원번호:8, 성별:'여', 나이:39},
    {회원번호:9, 성별:'남', 나이:41},
    {회원번호:10, 성별:'여', 나이:45},
    {회원번호:11, 성별:'남', 나이:48},
    {회원번호:12, 성별:'남', 나이:51},
    {회원번호:12, 성별:'남', 나이:61},
    {회원번호:12, 성별:'남', 나이:71},
]

// 6-1. 남성 여성 회원 수 세기


// 6-2. 평균 나이 구하기


// 6-3. 가장 어린 나이, 가장 많은 나이 구하기


// 6-4. 나이대 별로 회원 수 세기
    // 객체로 정리하기





// 7. 사과 박스 곰팡이 검사하기
const 곰팡이 = '🦠'
    //곰팡이가 생길 수도 있고 안 생길 수도 있는 코드
사과박스 = new Array(Math.floor(Math.random()*100)).fill('🍎')
Math.random() < 0.5 ? 사과박스[ Math.floor(Math.random() * 사과박스.length) ] = 곰팡이 : ''




// 8. 몬스터 잡기
    // 명중률이 있음
    // 몬스터가 나도 때림
const player = {
    체력: 100,
    공격력: 12,
    명중률: 80,
}

const monster = {
    체력: 60,
    공격력: 22,
    명중률: 70,
}